#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1maws_resourceexplorer2_index.index-example5: Refreshing state... [id=arn:aws:resource-explorer-2:us-east-1:199660179115:index/f6033c65-0360-40a9-b32c-7128b428ae3a][0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_role_policy_document: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.policy-doc: Reading...[0m[0m
[0m[1maws_kms_key.cloudtrail-key: Refreshing state... [id=5ec56f5c-5b57-41a0-8fe8-b52737d45a4b][0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_role_policy_document: Read complete after 0s [id=1789900679][0m
[0m[1mdata.aws_iam_policy_document.policy-doc: Read complete after 0s [id=2400697603][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=199660179115][0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_assume_role_policy: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_assume_role_policy: Read complete after 0s [id=1243534753][0m
[0m[1maws_iam_role.github_deployment_oidc_role: Refreshing state... [id=github-deployment-oidc-role][0m
[0m[1maws_resourceexplorer2_view.view-example5: Refreshing state... [id=arn:aws:resource-explorer-2:us-east-1:199660179115:view/exampleview7/f689085a-25f2-4e42-a8dc-1984a6fc3c63][0m
[0m[1maws_kms_alias.kms-alias: Refreshing state... [id=alias/cloudtrail-key][0m
[0m[1maws_iam_role_policy.github_actions_role_policy: Refreshing state... [id=github-deployment-oidc-role:github_deployment_oidc_role_policy][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_iam_policy.iam-policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "iam-policy" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m description = "kms iam policy"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "kms-iam-policy"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = [
                          [32m+[0m[0m "kms:GenerateDataKey*",
                          [32m+[0m[0m "kms:Decrypt",
                        ]
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m StringEquals = {
                              [32m+[0m[0m "aws:SourceArn" = "arn:aws:cloudtrail:us-east-1:530265417107:trail/niki-trail"
                            }
                          [32m+[0m[0m StringLike   = {
                              [32m+[0m[0m "kms:EncryptionContext:aws:cloudtrail:arn" = "arn:aws:cloudtrail:us-east-1:530265417107:trail/niki-trail/*"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Resource  = "*"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id   = (known after apply)
      [32m+[0m[0m tags_all    = (known after apply)
    }

[1m  # aws_kms_key_policy.key-policy[0m will be created
[0m  [32m+[0m[0m resource "aws_kms_key_policy" "key-policy" {
      [32m+[0m[0m bypass_policy_lockout_safety_check = false
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m key_id                             = "5ec56f5c-5b57-41a0-8fe8-b52737d45a4b"
      [32m+[0m[0m policy                             = (known after apply)
    }

[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dtaylor77, Action: `pull_request`, Workflow: `Aquanow Infrastructure DEV Pipeline`*